brew "git"
brew "bash" 
brew "stow" 
brew "zoxide"
brew "uv"
brew "ripgrep"
brew "jq"
brew "btop"
brew "bat"
brew "fd"
brew "fzf"
brew "eza"
brew "gh"
brew "just"
brew "lazygit"
brew "mise"
brew "neovim"
brew "wget"
brew "python"

# Apps
cask "1password"
brew "1password-cli"
cask "discord"
cask "helium-browser"
brew "orbstack"
cask "raycast"
